{
  
  "yes": "Sorry, I fail to store any previous message. Please specify what do you want to know.",
  
  "introduction": "I am a graduate from Materials Science & Engineering department in University of Rajshahi. A passionate programmer who have a decent knowledge on web development, AI and data analysis.",
  
  "about yourself": "I am a graduate from Materials Science & Engineering department in University of Rajshahi. A passionate programmer who have a decent knowledge on web development, AI and data analysis.",
  
  "about you": "I am a graduate from Materials Science & Engineering department in University of Rajshahi. A passionate programmer who have a decent knowledge on web development, AI and data analysis.",
  
  "academic": "I have graduated from Materials Science & Engineering, University of Rajshahi. Passing year 2024. I have obtained CGPA 3.28 out of 4.00",
  
  "education": "I have graduated from Materials Science & Engineering, University of Rajshahi. Passing year 2024. I have obtained CGPA 3.28 out of 4.00",
  
  "current": "Currently, i am unemployed. I am trying to get a scholarship for higher studies. Besides, i am open to work in any company that aligns with my interest and help me grow.",
  
  "doing now": "Currently, i am unemployed. I am trying to get a scholarship for higher studies. Besides, i am open to work in any company that aligns with my interest and help me grow.",
  
  "first": "Title:\n\n'Green Synthesis and Characterization of Ferrimagnetic Nickel Ferrite Nanoparticles from Seed Extract of Phoenix Dactylifera for Biomedical Applications'\n\nAbstract:\n\nThis study presents the green synthesis of nickel ferrite nanoparticles (NiFe₂O₄ NPs) using Phoenix dactylifera (date) seed extract, offering a sustainable, eco-friendly alternative to traditional methods. The resulting NiFe₂O₄ NPs displayed a saturation magnetization (Ms) of 6.342 emu/g, a remanent magnetization (Mr) of 1.45 emu/g, and coercivity (Hc) of -200 Oe, revealing ferrimagnetic behaviour. Thermal analysis showed stability, with significant decomposition beginning at 250°C and stabilization at 700°C. The FTIR spectrum confirmed characteristic Ni-O and Fe-O bonds, with a prominent peak at 598.41 cm⁻¹, indicating spinel structure formation. UV-Vis analysis displayed an absorption peak around 334 nm, consistent with nanoparticle formation. These properties suggest the synthesized NiFe₂O₄ NPs are promising for applications in hyperthermia cancer treatment, biosensing of heavy metals, and energy storage, with demonstrated biocompatibility and minimized environmental impact.\n\nDo you want to know about the second research work?",
  
  "second": "Title:\n\n'Lychee Honey-Mediated Synthesis and Characterization of Maghemite Nanoparticles: A Novel Approach for Potential Cancer Hyperthermia Applications'\n\nAbstract:\n\nIron oxide nanoparticles, specifically magnetite (-NPs), have become widely used and a significant area of research due to their superparamagnetism and distinctive properties. As a result, scientists are diligently looking into new uses for these nanoparticles. The choice and use of synthesis techniques are important variables that can affect the size and characteristics of the nanoparticles (NPs). The use of toxic chemicals that are absorbed on the surface of the nanoparticles has been linked to a number of negative effects of chemical synthesis methods. The Green synthesis of nanoparticles has emerged as an eco-friendly method in response to environmental concerns, giving researchers the chance to worldwide investigate the potential of various herbs for nanoparticle synthesis. Green synthesis is considered as a novel, rapid, and eco-friendly method for obtaining metallic nanoparticles (NPs). This study presents a novel and sustainable approach to synthesizing maghemite (γ-Fe2O3) nanoparticles using Lychee honey as a natural reducing and stabilizing agent. The green synthesis method eliminates the need for toxic chemicals, aligning with the principles of eco-friendly nanotechnology. The synthesized nanoparticles were characterized using a suite of techniques to confirm their structural, optical, thermal, and magnetic properties. Fourier Transform Infrared Spectroscopy (FTIR) identified functional groups from Lychee honey responsible for particle stabilization. Differential Thermal Analysis–Thermogravimetric Analysis (DTA-TGA) assessed thermal stability, while Ultraviolet-Visible (UV-Vis) Spectroscopy confirmed nanoparticle formation. Field Emission Scanning Electron Microscopy (FESEM) revealed uniform morphology and size, and Vibrating Sample Magnetometry (VSM) demonstrated superparamagnetic behavior, suggesting suitability for biomedical applications. These findings indicate that the synthesized nanoparticles possess the requisite properties for potential use in cancer hyperthermia therapy. Future research will focus on in vivo and in vitro studies to validate their clinical applicability. This work underscores the potential of green synthesis in advancing nanotechnology for sustainable and biomedical applications.\n\nDo you want to know about some of my work experiences?",
  
  "research": "Glad you asked that! My undergrad research project was 'Green Synthesis and Characterization of Ferrimagnetic Nickel Ferrite Nanoparticles from Seed Extract of Phoenix Dactylifera for Biomedical Applications'. I have also taken part in another research project 'Lychee Honey-Mediated Synthesis and Characterization of Maghemite Nanoparticles: A Novel Approach for Potential Cancer Hyperthermia Applications'. Both projects were praised a lot. One is on the way to be published in a journal.\n\nDo you want to know more about the first research work or the second research work?",
  
  "work": "So far, i have landed three projects.\n\nKamrul Academy: It is an e-learning platform, mainly CRUD application, designed as per client.\n\nPrescribemate: Digital Healthcare platform for Bangladeshi users. Encrypted data management, AI powered diagnosis and drug recommendation system is its core feature. Built a rule-based LLM from scratch\n\nMatSci Hub: A robust platform for materials science engineers and enthussiasts. Extensive materials database, AI powered MatBot for predictive analysis, degradation forecasts, and alloy composition recommendations.\n\nDo you want to know the tech stack used in particular project?",
  
  "experience": "So far, i have landed three projects.\n\nKamrul Academy: It is an e-learning platform, mainly CRUD application, designed as per client.\n\nPrescribemate: Digital Healthcare platform for Bangladeshi users. Encrypted data management, AI powered diagnosis and drug recommendation system is its core feature. Built a rule-based LLM from scratch\n\nMatSci Hub: A robust platform for materials science engineers and enthussiasts. Extensive materials database, AI powered MatBot for predictive analysis, degradation forecasts, and alloy composition recommendations.\n\nDo you want to know the tech stack used in particular project?",
  
  "kamrul": "Tech statck:\ndjango, djangorestframework, pymupdf, opencv, html-css-js, nginx, postgresql, gunicorn\n\nFeatures:\nCRUD, content delivery, secure payment, secure OTP login\n\nLink:\nhttps://kamrulacademy.com/\n\nI would be glad if you make a visit to the site.",
  
  "prescribemate": "Tech statck:\ndjango, djangorestframework, flutter, html-css-js, nginx, postgresql, gunicorn, pgbouncer\n\nFeatures:\nCRUD, encrypted data management, secure payment, secure login, Govt. data extraction and analysis, AI powered diagnosis and drug recommendation engine.\n\nLink:\nhttps://www.prescribemate.com/\n\nI would be glad if you make a visit to the site.",
  
  "matsci": "Tech statck:\ndjango, djangorestframework, matplotlib, html-css-js, nginx, postgresql, gunicorn\n\nFeatures:\nCRUD, secure OTP login, materials database, predictive analysis, degradation forecasts, and alloy composition recommendations\n\nLink:\nhttps://materialsscience.net/\n\nI would be glad if you make a visit to the site.",
  
  "skill": "My soft skills\n\nPython 🐍 : ██████████ 100%\nC  : ████████░░ 80%\nC++  : ████████░░ 80%\nMatLab  : ████████░░ 80%\nWeb Scrapping : ██████████ 100%\nAutomation : ██████████ 100%\nAI : ████████░░ 80%\nLinux   : ██████████ 100%\nJavaScript : █████████░ 90%\nHTML+CSS : █████████░ 90%\nNginx  : ████████░░ 80%\nPostgresql     : ████████░░ 80%\nDocker   : ███████░░░ 70%\nPentesting : ███████░░░ 70%",
  
  "react": "Sorry, reactjs is not my area. I know Django. I use it with REST Framework, Nginx, and Gunicorn in production.",
  
  "flutter": "Sorry, i don't know this.",
  
  "django": "Yes, I know Django. I use it with REST Framework, Nginx, and Gunicorn in production.",
  
  "hobby": "I love travelling, watching movies/tv series, hangout with friends. I play basketball, badminton and football. You will be surprised to know that i played in the university team, we won Championship twice in a row.",
  
  "leisure": "I love travelling, watching movies/tv series, hangout with friends. I play basketball, badminton and football. You will be surprised to know that i played in the university team, we won Championship twice in a row.",
  
  "contact": "You can reach out to me via:\n\n💬 Whatsapp - +8801635817747\n\n✉️ Email - saklantanvir@gmail.com\n\n💼 LinkedIn - https://www.linkedin.com/in/uch105/\n\n🤖 Github - https://github.com/uch105"
}
